   - [#  45] ROR classify_triangle:
--------------------------------------------------------------------------------
  11:         return 'InvalidInput'
  12:
  13:     if not ((isinstance(a, int) and isinstance(b, int) and isinstance(c, int))):
  14:         return 'InvalidInput'
- 15:     if (a >= b + c or b >= a + c or c >= a + b):
+ 15:     if (a >= b + c or b <= a + c or c >= a + b):
  16:         return 'NotATriangle'
  17:
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
--------------------------------------------------------------------------------
[0.00000 s] killed by test_equilateral_triangles (test_triangle.TestTriangles.test_equilateral_triangles)

   - [#  46] ROR classify_triangle:
--------------------------------------------------------------------------------
  11:         return 'InvalidInput'
  12:
  13:     if not ((isinstance(a, int) and isinstance(b, int) and isinstance(c, int))):
  14:         return 'InvalidInput'
- 15:     if (a >= b + c or b >= a + c or c >= a + b):
+ 15:     if (a >= b + c or b > a + c or c >= a + b):
  16:         return 'NotATriangle'
  17:
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
--------------------------------------------------------------------------------
[0.00036 s] survived

   - [#  47] ROR classify_triangle:
--------------------------------------------------------------------------------
  11:         return 'InvalidInput'
  12:
  13:     if not ((isinstance(a, int) and isinstance(b, int) and isinstance(c, int))):
  14:         return 'InvalidInput'
- 15:     if (a >= b + c or b >= a + c or c >= a + b):
+ 15:     if (a >= b + c or b >= a + c or c <= a + b):
  16:         return 'NotATriangle'
  17:
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
--------------------------------------------------------------------------------
[0.00100 s] killed by test_equilateral_triangles (test_triangle.TestTriangles.test_equilateral_triangles)

   - [#  48] ROR classify_triangle:
--------------------------------------------------------------------------------
  11:         return 'InvalidInput'
  12:
  13:     if not ((isinstance(a, int) and isinstance(b, int) and isinstance(c, int))):
  14:         return 'InvalidInput'
- 15:     if (a >= b + c or b >= a + c or c >= a + b):
+ 15:     if (a >= b + c or b >= a + c or c > a + b):
  16:         return 'NotATriangle'
  17:
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
--------------------------------------------------------------------------------
[0.00100 s] survived

   - [#  49] ROR classify_triangle:
--------------------------------------------------------------------------------
  14:         return 'InvalidInput'
  15:     if (a >= b + c or b >= a + c or c >= a + b):
  16:         return 'NotATriangle'
  17:
- 18:     if (a == b and b == c):
+ 18:     if (a != b and b == c):
  19:         return 'Equilateral'
  20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
  21:         return 'Right'
  22:     elif (a != b and b != c and a != c):
--------------------------------------------------------------------------------
[0.00086 s] killed by test_equilateral_triangles (test_triangle.TestTriangles.test_equilateral_triangles)

   - [#  50] ROR classify_triangle:
--------------------------------------------------------------------------------
  14:         return 'InvalidInput'
  15:     if (a >= b + c or b >= a + c or c >= a + b):
  16:         return 'NotATriangle'
  17:
- 18:     if (a == b and b == c):
+ 18:     if (a == b and b != c):
  19:         return 'Equilateral'
  20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
  21:         return 'Right'
  22:     elif (a != b and b != c and a != c):
--------------------------------------------------------------------------------
[0.00000 s] killed by test_equilateral_triangles (test_triangle.TestTriangles.test_equilateral_triangles)

   - [#  51] ROR classify_triangle:
--------------------------------------------------------------------------------
  16:         return 'NotATriangle'
  17:
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
- 20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
+ 20:     elif ((a ** 2) + (b ** 2) != c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
  21:         return 'Right'
  22:     elif (a != b and b != c and a != c):
  23:         return 'Scalene'
  24:     else:
--------------------------------------------------------------------------------
[0.00000 s] killed by test_isosceles_triangles (test_triangle.TestTriangles.test_isosceles_triangles)

   - [#  52] ROR classify_triangle:
--------------------------------------------------------------------------------
  16:         return 'NotATriangle'
  17:
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
- 20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
+ 20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) != a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
  21:         return 'Right'
  22:     elif (a != b and b != c and a != c):
  23:         return 'Scalene'
  24:     else:
--------------------------------------------------------------------------------
[0.00013 s] killed by test_isosceles_triangles (test_triangle.TestTriangles.test_isosceles_triangles)

   - [#  53] ROR classify_triangle:
--------------------------------------------------------------------------------
  16:         return 'NotATriangle'
  17:
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
- 20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
+ 20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) != b ** 2):
  21:         return 'Right'
  22:     elif (a != b and b != c and a != c):
  23:         return 'Scalene'
  24:     else:
--------------------------------------------------------------------------------
[0.00000 s] killed by test_isosceles_triangles (test_triangle.TestTriangles.test_isosceles_triangles)

   - [#  54] ROR classify_triangle:
--------------------------------------------------------------------------------
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
  20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
  21:         return 'Right'
- 22:     elif (a != b and b != c and a != c):
+ 22:     elif (a == b and b != c and a != c):
  23:         return 'Scalene'
  24:     else:
  25:         return 'Isosceles'
--------------------------------------------------------------------------------
[0.00100 s] killed by test_isosceles_triangles (test_triangle.TestTriangles.test_isosceles_triangles)

   - [#  55] ROR classify_triangle:
--------------------------------------------------------------------------------
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
  20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
  21:         return 'Right'
- 22:     elif (a != b and b != c and a != c):
+ 22:     elif (a != b and b == c and a != c):
  23:         return 'Scalene'
  24:     else:
  25:         return 'Isosceles'
--------------------------------------------------------------------------------
[0.00059 s] killed by test_isosceles_triangles (test_triangle.TestTriangles.test_isosceles_triangles)

   - [#  56] ROR classify_triangle:
--------------------------------------------------------------------------------
  18:     if (a == b and b == c):
  19:         return 'Equilateral'
  20:     elif ((a ** 2) + (b ** 2) == c ** 2 or (b ** 2) + (c ** 2) == a ** 2 or (a ** 2) + (c ** 2) == b ** 2):
  21:         return 'Right'
- 22:     elif (a != b and b != c and a != c):
+ 22:     elif (a != b and b != c and a == c):
  23:         return 'Scalene'
  24:     else:
  25:         return 'Isosceles'
--------------------------------------------------------------------------------
[0.00095 s] killed by test_scalene_triangles (test_triangle.TestTriangles.test_scalene_triangles)
